In [7]:
import pandas as pd

In [6]:
df = pd.read_csv(
    'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [8]:
# 1. find out how many male and female passenger was onboarded
male_passengers = len(df[df['Sex'] == 'male'])
female_passengers = len(df[df['Sex'] == 'female'])
print('Number of male passengers:', male_passengers)
print('Number of female passengers:', female_passengers)

Number of male passengers: 577
Number of female passengers: 314

In [9]:
# 2. how many survived
survivors = len(df[df['Survived'] == True])
print('Number of survivors:', survivors)

Number of survivors: 342

In [10]:
# 3. how many casualty we have
deceased = len(df[df['Survived'] == False])
print('Number of victims:', deceased)

Number of victims: 549

In [11]:
# 4. what is the name of the eldest person
eldest_person_name = df[df.Age == max(df.Age)].Name.values[0] #Trying the dot notation here
print('Name of the eldest passenger:', eldest_person_name)

Name of the eldest passenger: Barkworth, Mr. Algernon Henry Wilson

In [12]:
# 5. how many passenger do we have in first, second, third class
first_class_passengers = len(df[df['Pclass'] == 1])
second_class_passengers = len(df[df['Pclass'] == 2])
third_class_passengers = len(df[df['Pclass'] == 3])
print('Number of first class passengers:', first_class_passengers)
print('Number of second class passengers:', second_class_passengers)
print('Number of third class passengers:', third_class_passengers)

Number of first class passengers: 216
Number of second class passengers: 184
Number of third class passengers: 491

In [13]:
# 6. how many persons we have whose name start with 'S'
names_startswith_s = len(df[df.Name.str.startswith('S')])
print('Number of persons whose name starts with "S":', names_startswith_s)

Number of persons whose name starts with "S": 86

In [14]:
# 7. try to create a new column which is a summation of 'SibSp' and 'Parch'
df['SibSpParch'] = df['SibSp'] + df['Parch']
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SibSpParch
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [15]:
# 8. how many persons do we have below age of 25
passengers_aged_less_than_twenty_five = len(df[df.Age < 25])
print('Number of persons aged less than 25:', passengers_aged_less_than_twenty_five)

Number of persons aged less than 25: 278

In [16]:
# 9. how many persons died whose age was less than 40
deceased_at_less_than_40 = len(df[(df.Survived == False) & (df.Age < 40)])
print('Number of victims aged less than 40:', deceased_at_less_than_40)

Number of victims aged less than 40: 322

In [17]:
# 10. from a cabin column, separate text and numeric value

cabin_numbers = df.Cabin[~df.Cabin.isna()].str[1:]
cabin_text = df.Cabin[~df.Cabin.isna()].str[0]
cabin_numbers

1              85
3             123
6              46
10              6
11            103
          ...
871            35
872    51 B53 B55
879            50
887            42
889           148
Name: Cabin, Length: 204, dtype: object

In [18]:
cabin_text

1      C
3      C
6      E
10     G
11     C
      ..
871    D
872    B
879    C
887    B
889    C
Name: Cabin, Length: 204, dtype: object